<template>
  <!-- 男/女 体重百分位数值 -->
  <div
    style="width: 95%;
    height: 670px;
    background: #ffffff;
    border-radius: 10px;
    margin-top: 10px">

    <!-- button for choose this module -->
    <div class="chooseModuleButton"
         style="margin: 0 0 0 10px;padding-top: 5px;">
      <el-button @click="chooseTheChart" :type="isChosen" v-model="moduleChooseStatus">{{ moduleChooseStatus }}</el-button>
    </div>

    <!-- DOM 根节点 -->
    <!--<div id="myChartOfCircumference"-->
         <!--:style="{-->
       <!--width: '100%',-->
       <!--height: '630px',-->
       <!--padding: '10px 0 0 10px'-->
       <!--}">-->
    <!--</div>-->
    <div id="myChartOfWeight"
         :style="{
       width: '100%',
       height: '630px',
       padding: '10px 0 0 10px'
       }">
    </div>
  </div>
</template>

<script>
  export default {
    data () {
      return {
        // 是否选择当前模块
        isChosen: 'primary',
        moduleChooseStatus: '选择'
      }
    },

    mounted () {
      // 用户 ID，检测次数
      const currentUsersIdForWeight = this.$store.getters.getId;
      const times = this.$store.getters.getMeasuresTimes;
      // 获取数据
      this.getUsersDataAboutWeight(currentUsersIdForWeight, times);
    },

    methods: {

      /**
       * @function: upload current chart to server
       * @param: chartParamOfWeight
       * @return: null
       * @author: White
       * @date: 19 - 06 - 27
       * */
      uploadTheChartFile (chartParamOfWeight) {
        try {
          const times = this.$store.getters.getMeasuresTimes;
          // 数据序列化
          let currentUsersChartsDataOfWeight = new FormData();
          // 拼接 key 与 value
          // 用户 ID
          currentUsersChartsDataOfWeight.append('guardian_phone', this.$store.getters.getId);
          currentUsersChartsDataOfWeight.append('inspectOrder', times);
          // 当前图表文件
          currentUsersChartsDataOfWeight.append('file', chartParamOfWeight, chartParamOfWeight.name);
          this.axios.post('http://localhost:8082/systemImgUpload/uploadSystemImg', currentUsersChartsDataOfWeight, {
            // 定义表头
            headers: {
              'Content-Type': 'multipart/form-data'
            }
          })
            .then((response) => {
              console.log(response)
              // 判断是否上传成功
              if (response.status === 200){
                this.$message({
                  message: '选择成功',
                  type: 'success'
                })
                // 改变选中按钮的状态
                this.isChosen = 'success';
                this.moduleChooseStatus = '已选择';
              } else {
                this.$alert('服务器未响应：' + response.status, '错误！', {
                  confirmButtonText: '确定',
                  callback: action => {
                    // 回调信息
                    console.log("确认信息：" + action)
                  }
                })
              }
            },err => {
              console.log('some mistakes has happened:' + err)
            })
            .catch(
              // 异常处理
            )
        } catch (e) {
          throw new DOMException(e)
        }
      },

      /**
       * @function: choose this chart to show in report (weight)
       * @param: null
       * @return: null
       * @author: White
       * @date: 19 - 06 - 27
       * */
      chooseTheChart () {
        // 将 base64 转换方法放在此方法内！！
        // due to Vue component
        /**
         * @function: convert base64 to file(image/png)
         * */
        const convertBase64 = function (dataUrl, filename) {
          let arr = dataUrl.split(','),  // 分割
            base64Code = arr[0].match(/:(.*?);/)[1],  // 查询匹配的字符
            base64Decode = atob(arr[1]),  // 解码 base64
            n = base64Decode.length,
            // 8 位无符号整数值类型化数组
            u8arr = new Uint8Array(n);
          while(n--){
            u8arr[n] = base64Decode.charCodeAt(n);
          }
          // 返回生成的 File 对象
          return new File([u8arr], filename, {
            type: base64Code
          });
        }

        // 获取当前 canvas 元素
        let canvasContainer = document.getElementById('myChartOfWeight').getElementsByTagName('canvas');
        console.log(canvasContainer[0]);

        /**
         * @function: test canvas to png for base64
         * */
        const baseContainer = canvasContainer[0].toDataURL("image/png");

        // 转换成 File()，并使用
        const newPictureFile = convertBase64(baseContainer, this.$store.getters.getId + '_Weight.png');
        // 发起请求
        this.uploadTheChartFile(newPictureFile);
      },

      /**
       * @function: get user's data about information and weight
       * @param: currentUsersIdForData
       * @return: null
       * @author: White
       * @date: 19 - 06 - 20
       * */
      getUsersDataAboutWeight (currentUsersIdForData, times) {
        // 并发请求
        try {
          this.axios.all([
            this.axios.get('http://localhost:8082/information/search', {
              params: {
                guardian_phone: currentUsersIdForData,
                inspectOrder: times
              }
            }),
            this.axios.get('http://localhost:8082/bodyCompositionTest/search', {
              params: {
                guardian_phone: currentUsersIdForData,
                inspectOrder: times
              }
            })
          ])
            .then(this.axios.spread((paramForUsersAgeAndSexInBmi, paramForUsersValueOfBmi) => {
              console.log('the first param:')
              console.log(paramForUsersAgeAndSexInBmi)
              console.log('the 2rd param:')
              console.log(paramForUsersValueOfBmi)

              // 获取当前用户的信息
              // 基本信息
              const currentUserParamsOfSex = paramForUsersAgeAndSexInBmi.data.data;
              // 年龄
              const currentUserParamOfAge = paramForUsersAgeAndSexInBmi.data.data.age;
              // 体成分测量数据
              const requestDataForWeight = paramForUsersValueOfBmi.data.data.weight;
              console.log('weight:' + requestDataForWeight)
              // 作图
              this.drawCurveOfWeight(currentUserParamsOfSex, currentUserParamOfAge, requestDataForWeight);
            }))
            .catch(
              // ...
            )
        } catch (e) {
          this.$alert('服务器开小差了：' + e, '错误！', {
            confirmButtonText: '确定',
            callback: action => {
              // 回调信息
              console.log("确认信息：" + action);
            }
          })
        }
      },

      /**
       * @function: deal the format of users age
       * @param: formatUsersAgeParam
       * @return: formattedUsersAge
       * @author: White
       * @date: 19 - 06 - 19
       * */
      formatTheCurrentUsersAgeInWeight (formatUsersAgeParam) {
        let ageSplitArrayContainer = [];
        ageSplitArrayContainer = formatUsersAgeParam.split('岁')
        let ageSplitArrayForMonth = ageSplitArrayContainer[1].split('个月')
        let formattedUsersAge = parseInt(formatUsersAgeParam) + parseInt(ageSplitArrayContainer[1])/12 + parseInt(ageSplitArrayForMonth[1])/360;
        return formattedUsersAge;
      },

      /**
       * @function: 初始化 echarts 实例
       * @date: 19 - 06 - 04
       * @param: paramInformation
       * @param: paramAge
       * @param: paramWeight
       * @return: null
       * @author: White
       * @date: 19 - 06 - 20
       * @description: 优化算法后，无性别时，画图含有空表格
       * */
      drawCurveOfWeight (paramInformation, paramAge, paramWeight) {

        // 存储用户数据 - 年龄、BMI
        let currentUsersDataOfAgeAndWeight = [];
        // currentUsersDataOfAgeAndWeight.unshift(this.formatTheCurrentUsersAgeInWeight(paramAge), paramWeight)
        currentUsersDataOfAgeAndWeight.unshift(paramAge, paramWeight)

        /**
         * @variation: 图表参考曲线数据 - 男
         * */
        // P3
        const referenceWeightCurveDataOfBoysP3 = [
          [0, 2.62], [0.5, 6.8], [1, 8.16], [1.5, 9.19], [2, 10.22], [2.5, 11.11], [3, 11.94], [3.5, 12.73], [4, 13.52], [4.5, 14.37],
          [5, 15.26], [5.5, 16.09], [6, 16.8], [6.5, 17.53], [7, 18.48], [7.5, 19.43], [8, 20.32], [8.5, 21.18], [9, 22.04], [9.5, 22.95],
          [10, 23.89], [10.5, 24.96], [11, 26.21], [11.5, 27.59], [12, 29.09], [12.5, 30.74], [13, 32.82], [13.5, 35.03], [14, 37.36], [14.5, 39.53],
          [15, 41.43], [15.5, 43.05], [16, 44.28], [16.5, 45.3], [17, 46.04], [18, 47.01]
        ]

        // P10
        const referenceWeightCurveDataOfBoysP10 = [
          [0, 2.83], [0.5, 7.28], [1, 8.72], [1.5, 9.81], [2, 10.9], [2.5, 11.85], [3, 12.74], [3.5, 13.58], [4, 14.43], [4.5, 15.35],
          [5, 16.33], [5.5, 17.26], [6, 18.06], [6.5, 18.92], [7, 20.04], [7.5, 21.17], [8, 22.24], [8.5, 23.28], [9, 24.31], [9.5, 25.42],
          [10, 26.55], [10.5, 27.83], [11, 29.33], [11.5, 30.97], [12, 32.77], [12.5, 34.71], [13, 37.04], [13.5, 39.42], [14, 41.8], [14.5, 43.94],
          [15, 45.77], [15.5, 47.31], [16, 48.47], [16.5, 49.42], [17, 50.11], [18, 51.02]
        ]

        // P25
        const referenceWeightCurveDataOfBoysP25 = [
          [0, 3.06], [0.5, 7.8], [1, 9.33], [1.5, 10.84], [2, 11.65], [2.5, 12.66], [3, 13.61], [3.5, 14.51], [4, 15.43], [4.5, 16.43],
          [5, 17.52], [5.5, 18.56], [6, 19.49], [6.5, 20.49], [7, 21.81], [7.5, 23.16], [8, 24.46], [8.5, 25.73], [9, 26.98], [9.5, 28.31],
          [10, 29.66], [10.5, 31.2], [11, 32.97], [11.5, 34.91], [12, 37.03], [12.5, 39.29], [13, 41.9], [13.5, 44.45], [14, 46.9], [14.5, 49],
          [15, 50.75], [15.5, 52.19], [16, 53.26], [16.5, 54.13], [17, 54.77], [18, 55.6]
        ]

        // P50
        const referenceWeightCurveDataOfBoysP50 = [
          [0, 3.32], [0.5, 8.41], [1, 10.05], [1.5, 11.29], [2, 12.54], [2.5, 13.64], [3, 14.65], [3.5, 15.63], [4, 16.64], [4.5, 17.75],
          [5, 18.98], [5.5, 20.18], [6, 21.26], [6.5, 22.45], [7, 24.06], [7.5, 25.72], [8, 27.33], [8.5, 28.91], [9, 30.46], [9.5, 32.09],
          [10, 33.74], [10.5, 35.58], [11, 37.69], [11.5, 39.98], [12, 42.49], [12.5, 45.13], [13, 48.08], [13.5, 50.85], [14, 53.37], [14.5, 55.43],
          [15, 57.08], [15.5, 58.39], [16, 59.35], [16.5, 60.12], [17, 60.68], [18, 61.4]
        ]

        // P75
        const referenceWeightCurveDataOfBoysP75 = [
          [0, 3.59], [0.5, 9.07], [1, 10.83], [1.5, 12.16], [2, 13.51], [2.5, 14.7], [3, 15.8], [3.5, 16.86], [4, 17.98], [4.5, 19.22],
          [5, 20.61], [5.5, 21.98], [6, 23.26], [6.5, 24.7], [7, 26.66], [7.5, 28.7], [8, 30.71], [8.5, 32.69], [9, 34.61], [9.5, 36.61],
          [10, 38.61], [10.5, 40.81], [11, 43.27], [11.5, 45.94], [12, 48.86], [12.5, 51.89], [13, 55.21], [13.5, 58.21], [14, 60.83], [14.5, 62.86],
          [15, 64.4], [15.5, 65.57], [16, 66.4], [16.5, 67.05], [17, 67.51], [18, 68.11]
        ]

        // P90
        const referenceWeightCurveDataOfBoysP90 = [
          [0, 3.85], [0.5, 9.7], [1, 11.58], [1.5, 13.01], [2, 14.46], [2.5, 15.73], [3, 16.92], [3.5, 18.08], [4, 19.29], [4.5, 20.67],
          [5, 22.23], [5.5, 23.81], [6, 25.29], [6.5, 27], [7, 29.35], [7.5, 31.84], [8, 34.31], [8.5, 36.74], [9, 39.08], [9.5, 41.49],
          [10, 43.85], [10.5, 46.4], [11, 49.2], [11.5, 52.21], [12, 55.5], [12.5, 58.9], [13, 62.57], [13.5, 65.8], [14, 68.53], [14.5, 70.55],
          [15, 72], [15.5, 73.03], [16, 73.73], [16.5, 74.25], [17, 74.62], [18, 75.08]
        ]

        // P97
        const referenceWeightCurveDataOfBoysP97 = [
          [0, 4.12], [0.5, 10.37], [1, 12.37], [1.5, 13.9], [2, 15.46], [2.5, 16.83], [3, 18.12], [3.5, 19.38], [4, 20.71], [4.5, 22.24],
          [5, 24], [5.5, 25.81], [6, 27.55], [6.5, 29.57], [7, 32.41], [7.5, 35.45], [8, 38.49], [8.5, 41.49], [9, 44.35], [9.5, 47.24],
          [10, 50.01], [10.5, 52.93], [11, 56.07], [11.5, 59.4], [12, 63.04], [12.5, 66.81], [13, 70.83], [13.5, 74.33], [14, 77.2], [14.5, 79.24],
          [15, 80.6], [15.5, 81.49], [16, 82.05], [16.5, 82.44], [17, 82.7], [18, 83]
        ]

        /**
         * @variation: 图表参考曲线数据 - 女
         * */
          // P3
        const referenceWeightCurveDataOfGirlsP3 = [
            [0, 2.57], [0.5, 6.34], [1, 7.7], [1.5, 8.73], [2, 9.76], [2.5, 10.65], [3, 11.5], [3.5, 12.32], [4, 13.1], [4.5, 13.89],
            [5, 14.64], [5.5, 15.39], [6, 16.1], [6.5, 16.8], [7, 17.58], [7.5, 18.39], [8, 19.2], [8.5, 20.05], [9, 20.93], [9.5, 21.89],
            [10, 22.98], [10.5, 24.22], [11, 25.74], [11.5, 27.43], [12, 29.33], [12.5, 31.22], [13, 33.09], [13.5, 34.82], [14, 36.38], [14.5, 37.71],
            [15, 38.73], [15.5, 39.51], [16, 39.96], [16.5, 40.29], [17, 40.44], [18, 40.71]
          ]

        // P10
        const referenceWeightCurveDataOfGirlsP10 = [
          [0, 2.76], [0.5, 6.76], [1, 8.2], [1.5, 9.29], [2, 10.39], [2.5, 11.35], [3, 12.27], [3.5, 13.14], [4, 13.99], [4.5, 14.85],
          [5, 15.68], [5.5, 16.52], [6, 17.32], [6.5, 18.12], [7, 19.01], [7.5, 19.95], [8, 20.89], [8.5, 21.88], [9, 22.93], [9.5, 24.08],
          [10, 25.36], [10.5, 26.8], [11, 28.53], [11.5, 30.39], [12, 32.42], [12.5, 34.39], [13, 36.29], [13.5, 38.01], [14, 39.55], [14.5, 40.84],
          [15, 41.83], [15.5, 42.58], [16, 43.01], [16.5, 43.32], [17, 43.47], [18, 43.73]
        ]

        // P25
        const referenceWeightCurveDataOfGirlsP25 = [
          [0, 2.96], [0.5, 7.21], [1, 8.74], [1.5, 9.91], [2, 11.08], [2.5, 12.12], [3, 13.11], [3.5, 14.05], [4, 14.97], [4.5, 15.92],
          [5, 16.84], [5.5, 17.78], [6, 18.68], [6.5, 19.6], [7, 20.62], [7.5, 21.71], [8, 22.81], [8.5, 23.99], [9, 25.23], [9.5, 26.61],
          [10, 28.15], [10.5, 29.84], [11, 31.81], [11.5, 33.86], [12, 36.04], [12.5, 38.09], [13, 40], [13.5, 41.69], [14, 43.19], [14.5, 44.43],
          [15, 45.36], [15.5, 46.06], [16, 46.47], [16.5, 46.76], [17, 46.9], [18, 47.14]
        ]

        // P50
        const referenceWeightCurveDataOfGirlsP50 = [
          [0, 3.21], [0.5, 7.77], [1, 9.4], [1.5, 10.65], [2, 11.92], [2.5, 13.05], [3, 14.13], [3.5, 15.16], [4, 16.17], [4.5, 17.22],
          [5, 18.26], [5.5, 19.33], [6, 20.37], [6.5, 21.44], [7, 22.64], [7.5, 23.93], [8, 25.25], [8.5, 26.67], [9, 28.19], [9.5, 29.87],
          [10, 31.76], [10.5, 33.8], [11, 36.1], [11.5, 38.4], [12, 40.77], [12.5, 42.89], [13, 44.79], [13.5, 46.42], [14, 47.83], [14.5, 48.97],
          [15, 49.82], [15.5, 50.45], [16, 50.81], [16.5, 51.07], [17, 51.2], [18, 51.41]
        ]

        // P75
        const referenceWeightCurveDataOfGirlsP75 = [
          [0, 3.49], [0.5, 8.37], [1, 10.12], [1.5, 11.46], [2, 12.84], [2.5, 14.07], [3, 15.25], [3.5, 16.38], [4, 17.5], [4.5, 18.66],
          [5, 19.83], [5.5, 21.06], [6, 22.27], [6.5, 23.51], [7, 24.94], [7.5, 26.48], [8, 28.05], [8.5, 29.77], [9, 31.63], [9.5, 33.72],
          [10, 36.05], [10.5, 38.53], [11, 41.24], [11.5, 43.85], [12, 46.42], [12.5, 48.6], [13, 50.45], [13.5, 51.97], [14, 53.23], [14.5, 54.23],
          [15, 54.96], [15.5, 55.49], [16, 55.79], [16.5, 56.01], [17, 56.11], [18, 56.28]
        ]

        // P90
        const referenceWeightCurveDataOfGirlsP90 = [
          [0, 3.75], [0.5, 8.96], [1, 10.82], [1.5, 12.25], [2, 13.74], [2.5, 15.08], [3, 16.36], [3.5, 17.59], [4, 18.81], [4.5, 20.1],
          [5, 21.41], [5.5, 22.81], [6, 24.19], [6.5, 25.62], [7, 27.28], [7.5, 29.08], [8, 30.95], [8.5, 33], [9, 35.26], [9.5, 37.79],
          [10, 40.63], [10.5, 43.61], [11, 46.78], [11.5, 49.73], [12, 52.49], [12.5, 54.71], [13, 56.46], [13.5, 57.81], [14, 58.88], [14.5, 59.7],
          [15, 60.28], [15.5, 60.69], [16, 60.91], [16.5, 61.07], [17, 61.15], [18, 61.28]
        ]

        // P97
        const referenceWeightCurveDataOfGirlsP97 = [
          [0, 4.04], [0.5, 9.59], [1, 11.57], [1.5, 13.11], [2, 14.71], [2.5, 16.16], [3, 17.55], [3.5, 18.89], [4, 20.24], [4.5, 21.67],
          [5, 23.14], [5.5, 24.72], [6, 26.3], [6.5, 27.96], [7, 29.89], [7.5, 32.01], [8, 34.23], [8.5, 36.69], [9, 39.41], [9.5, 42.51],
          [10, 45.97], [10.5, 49.59], [11, 53.33], [11.5, 56.67], [12, 59.64], [12.5, 61.86], [13, 63.45], [13.5, 64.55], [14, 65.36], [14.5, 65.93],
          [15, 66.3], [15.5, 66.55], [16, 66.69], [16.5, 66.78], [17, 66.82], [18, 66.89]
        ]

        // 初始化 echarts 实例
        let chartsOfUsersWeight = this.$echarts.init(document.getElementById('myChartOfWeight'));

        // 配置 - 男
        let usersWeightOptionOfBoy = {
          // 图表标题
          title: {
            text: '体重百分位（男）'
          },
          // 类别显示
          legend: {},
          // 极坐标
          grid: {},

          // X 轴
          xAxis: {
            // 数据类型
            type: 'value',
            // X 轴坐标标签
            name: '年龄（岁）',
            // 标签位置
            nameLocation: 'middle',
            // 标题跟坐标轴的距离
            nameGap: 25,
            // 从零刻度线开始
            // boundaryGap: false,
            axisTick: {
              alignWithLabel: true
            },
            /*            splitArea: {
                          show: true
                        },*/
            splitLine: {
              lineStyle: {
                color: ['#aaa']
              }
            },
            // 标题名称
            nameTextStyle: {
              fontWeight: 'bold',
              fontSize: 16,
            },
            // 坐标轴分割段数
            splitNumber: 30,
            // 横坐标数值
            /*
            * 取值则在每一个点的数组中设置对应的 index
            * */
            // data: ['0月', '2月', '4月', '6月', '9月', '12月', '15月', '18月', '21月', '2岁', '2.5岁', '3岁', '3.5岁', '4岁', '4.5岁', '5岁', '5.5岁', '6.0岁', '6.5岁', '7.0岁', '7.5岁', '8.0岁', '8.5岁', '9.0岁', '9.5岁', '10.0岁', '10.5岁', '11.0岁', '11.5岁', '12.0岁', '12.5岁', '13.0岁', '13.5岁', '14.0岁', '14.5岁', '15.0岁', '15.5岁', '16.0岁', '16.5岁', '17.0岁', '18.0岁']
            // data: ['2.0岁', '2.5岁', '3.0岁', '3.5岁', '4.0岁', '4.5岁', '5.0岁', '5.5岁', '6.0岁', '6.5岁', '7.0岁', '7.5岁', '8.0岁', '8.5岁', '9.0岁', '9.5岁', '10.0岁', '10.5岁', '11.0岁', '11.5岁', '12.0岁', '12.5岁', '13.0岁', '13.5岁', '14.0岁', '14.5岁', '15.0岁', '15.5岁', '16.0岁', '16.5岁', '17.0岁', '17.5岁', '18.0岁']
          },
          yAxis: [
            // 左轴
            {
              type: 'value',
              // 标识名
              name: '体重百分位数值（kg）',
              // 标识名位置 - 坐标轴名称
              nameLocation: 'middle',
              nameGap: 25,
              min: 0,
              max: 85,
              nameTextStyle: {
                fontWeight: 'bold',
                fontSize: 16
              }
            },
            // 右轴
            {
              type: 'value',
              min: 0,
              max: 85
            }
          ],
          series: [
            // 线条一
            {
              name: 'P3',
              // 折线类型
              type: 'line',
              // 是否光滑
              smooth: true,
              // 拐点类型
              symbol: 'none',
              // 数值
              data: referenceWeightCurveDataOfBoysP3
              // data: [2.62, 4.53, 5.99, 6.8, 7.56, 8.16, 8.68, 9.19, 9.71, 10.22, 11.11, 11.94, 12.73, 13.52, 14.37, 15.26, 16.09, 16.8, 17.53, 18.48, 19.43, 20.32, 21.18, 22.04, 22.95, 23.89, 24.96, 26.21, 27.59, 29.09, 30.74, 32.82, 35.03, 37.36, 39.53, 41.43, 43.05, 44.28, 45.3, 46.04, 47.01]
            },
            // 线条二
            {
              name: 'P10',
              // 折线类型
              type: 'line',
              // 是否光滑
              smooth: true,
              // 拐点类型
              symbol: 'none',
              data: referenceWeightCurveDataOfBoysP10
              // data: [2.83, 4.88, 6.43, 7.28, 8.09, 8.72, 9.27, 9.81, 10.37, 10.9, 11.85, 12.74, 13.58, 14.43, 15.35, 16.33, 17.26, 18.06, 18.92, 20.04, 21.17, 22.24, 23.28, 24.31, 25.42, 26.55, 27.83, 29.33, 30.97, 32.77, 34.71, 37.04, 39.42, 41.8, 43.94, 45.77, 47.31, 48.47, 49.42, 50.11, 51.02]
            },
            // 线条三
            {
              name: 'P25',
              // 折线类型
              type: 'line',
              // 是否光滑
              smooth: true,
              // 拐点类型
              symbol: 'none',
              data: referenceWeightCurveDataOfBoysP25
              // data: [3.06, 5.52, 6.9, 7.8, 8.66, 9.33, 9.91, 10.84, 11.08, 11.65, 12.66, 13.61, 14.51, 15.43, 16.43, 17.52, 18.56, 19.49, 20.49, 21.81, 23.16, 24.46, 25.73, 26.98, 28.31, 29.66, 31.2, 32.97, 34.91, 37.03, 39.29, 41.9, 44.45, 46.9, 49, 50.75, 52.19, 53.26, 54.13, 54.77, 55.6]
            },
            // 线条四
            {
              name: 'P50',
              // 折线类型
              type: 'line',
              // 是否光滑
              smooth: true,
              // 拐点类型
              symbol: 'none',
              data: referenceWeightCurveDataOfBoysP50
              // data: [3.32, 5.68, 7.45, 8.41, 9.33, 10.05, 10.68, 11.29, 11.93, 12.54, 13.64, 14.65, 15.63, 16.64, 17.75, 18.98, 20.18, 21.26, 22.45, 24.06, 25.72, 27.33, 28.91, 30.46, 32.09, 33.74, 35.58, 37.69, 39.98, 42.49, 45.13, 48.08, 50.85, 53.37, 55.43, 57.08, 58.39, 59.35, 60.12, 60.68, 61.4]
            },
            // 线条五
            {
              name: 'P75',
              // 折线类型
              type: 'line',
              // 是否光滑
              smooth: true,
              // 拐点类型
              symbol: 'none',
              data: referenceWeightCurveDataOfBoysP75
              // data: [3.59, 6.15, 8.04, 9.07, 10.06, 10.83, 11.51, 12.16, 12.86, 13.51, 14.7, 15.8, 16.86, 17.98, 19.22, 20.61, 21.98, 23.26, 24.7, 26.66, 28.7, 30.71, 32.69, 34.61, 36.61, 38.61, 40.81, 43.27, 45.94, 48.86, 51.89, 55.21, 58.21, 60.83, 62.86, 64.4, 65.57, 66.4, 67.05, 67.51, 68.11]
            },
            // 线条六
            {
              name: 'P90',
              // 折线类型
              type: 'line',
              // 是否光滑
              smooth: true,
              // 拐点类型
              symbol: 'none',
              data: referenceWeightCurveDataOfBoysP90
              // data: [3.85, 6.59, 8.61, 9.7, 10.75, 11.58, 12.3, 13.01, 13.75, 14.46, 15.73, 16.92, 18.08, 19.29, 20.67, 22.23, 23.81, 25.29, 27, 29.35, 31.84, 34.31, 36.74, 39.08, 41.49, 43.85, 46.4, 49.2, 52.21, 55.5, 58.9, 62.57, 65.8, 68.53, 70.55, 72, 73.03, 73.73, 74.25, 74.62, 75.08]
            },
            // 线条七
            {
              name: 'P97',
              // 折线类型
              type: 'line',
              // 是否光滑
              smooth: true,
              // 拐点类型
              symbol: 'none',
              data: referenceWeightCurveDataOfBoysP97
              // data: [4.12, 7.05, 9.2, 10.37, 11.49, 12.37, 13.15, 13.9, 14.7, 15.46, 16.83, 18.12, 19.38, 20.71, 22.24, 24, 25.81, 27.55, 29.57, 32.41, 35.45, 38.49, 41.49, 44.35, 47.24, 50.01, 52.93, 56.07, 59.4, 63.04, 66.81, 70.83, 74.33, 77.2, 79.24, 80.6, 81.49, 82.05, 82.44, 82.7, 83]
            },
            // 用户数据显示
            {
              name: '用户',
              type: 'line',
              color: 'black',
              symbol: 'circle',
              symbolSize: 10,
              data: [currentUsersDataOfAgeAndWeight]
            }
          ]
        }

        // 配置 - 女
        const usersWeightOptionOfGirl = {
          // 图表标题
          title: {
            text: '体重百分位（女）'
          },
          // 类别显示
          legend: {},
          // 极坐标
          grid: {},

          // X 轴
          xAxis: {
            // 数据类型
            type: 'value',
            // X 轴坐标标签
            name: '年龄（岁）',
            // 标签位置
            nameLocation: 'middle',
            // 标题跟坐标轴的距离
            nameGap: 25,
            // 从零刻度线开始
            boundaryGap: false,
            axisTick: {
              alignWithLabel: true
            },
            /*            splitArea: {
                          show: true
                        },*/
            splitLine: {
              lineStyle: {
                color: ['#aaa']
              }
            },
            // 标题名称
            nameTextStyle: {
              fontWeight: 'bold',
              fontSize: 16,
            },
            // 坐标轴分割段数
            splitNumber: 30,
            // 横坐标数值
            /*
            * 取值则在每一个点的数组中设置对应的 index
            * */
            // data: ['0月', '2月', '4月', '6月', '9月', '12月', '15月', '18月', '21月', '2岁', '2.5岁', '3岁', '3.5岁', '4岁', '4.5岁', '5岁', '5.5岁', '6.0岁', '6.5岁', '7.0岁', '7.5岁', '8.0岁', '8.5岁', '9.0岁', '9.5岁', '10.0岁', '10.5岁', '11.0岁', '11.5岁', '12.0岁', '12.5岁', '13.0岁', '13.5岁', '14.0岁', '14.5岁', '15.0岁', '15.5岁', '16.0岁', '16.5岁', '17.0岁', '18.0岁']
            // data: ['2.0岁', '2.5岁', '3.0岁', '3.5岁', '4.0岁', '4.5岁', '5.0岁', '5.5岁', '6.0岁', '6.5岁', '7.0岁', '7.5岁', '8.0岁', '8.5岁', '9.0岁', '9.5岁', '10.0岁', '10.5岁', '11.0岁', '11.5岁', '12.0岁', '12.5岁', '13.0岁', '13.5岁', '14.0岁', '14.5岁', '15.0岁', '15.5岁', '16.0岁', '16.5岁', '17.0岁', '17.5岁', '18.0岁']
          },
          yAxis: [
            // 左轴
            {
              type: 'value',
              // 标识名
              name: '体重百分位数值（kg）',
              // 标识名位置 - 坐标轴名称
              nameLocation: 'middle',
              nameGap: 25,
              min: 0,
              max: 70,
              nameTextStyle: {
                fontWeight: 'bold',
                fontSize: 16
              }
            },
            // 右轴
            {
              type: 'value',
              min: 0,
              max: 70
            }
          ],
          series: [
            // 线条一
            {
              name: 'P3',
              // 折线类型
              type: 'line',
              // 是否光滑
              smooth: true,
              // 拐点类型
              symbol: 'none',
              // 拐点大小
              symbolSize: 7,
              data: referenceWeightCurveDataOfGirlsP3
              // data: [2.57, 4.21, 5.55, 6.34, 7.11, 7.7, 8.22, 8.73, 9.26, 9.76, 10.65, 11.5, 12.32, 13.1, 13.89, 14.64, 15.39, 16.1, 16.8, 17.58, 18.39, 19.2, 20.05, 20.93, 21.89, 22.98, 24.22, 25.74, 27.43, 29.33, 31.22, 33.09, 34.82, 36.38, 37.71, 38.73, 39.51, 39.96, 40.29, 40.44, 40.71]
              // data: [13.91, 13.64, 13.45, 13.31, 13.17, 13.04, 12.92, 12.84, 12.77, 12.72, 12.68, 12.67, 12.69, 12.75, 12.83, 12.96, 13.12, 13.31, 13.53, 13.77, 14.02, 14.29, 14.54, 14.8, 15.03, 15.25, 15.44, 15.62, 15.77, 15.91, 16.04, 16.15, 16.26]
              // data: [14.26, 13.99, 13.74, 13.55, 13.4, 13.28, 13.21, 13.16, 13.12, 13.09, 13.1, 13.12, 13.17, 13.24, 13.33, 13.45, 13.59, 13.74, 13.92, 14.1, 14.28, 14.46, 14.65, 14.84, 15.02, 15.2, 15.37, 15.53, 15.69, 15.85, 15.99, 16.14, 16.27]
            },
            // 线条二
            {
              name: 'P10',
              // 折线类型
              type: 'line',
              // 是否光滑
              smooth: true,
              // 拐点类型
              symbol: 'none',
              // 拐点大小
              symbolSize: 7,
              data: referenceWeightCurveDataOfGirlsP10
              // data: [2.76, 4.5, 5.93, 6.76, 7.58, 8.2, 8.75, 9.29, 9.86, 10.39, 11.35, 12.27, 13.14, 13.99, 14.85, 15.68, 16.52, 17.32, 18.12, 19.01, 19.95, 20.89, 21.88, 22.93, 24.08, 25.36, 26.8, 28.53, 30.39, 32.42, 34.39, 36.29, 38.01, 39.55, 40.84, 41.83, 42.58, 43.01, 43.32, 43.47, 43.73]
              // data: [14.5, 14.22, 14.02, 13.88, 13.74, 13.62, 13.52, 13.44, 13.39, 13.35, 13.34, 13.35, 13.4, 13.48, 13.59, 13.75, 13.93, 14.15, 14.4, 14.67, 14.96, 15.24, 15.52, 15.79, 16.05, 16.28, 16.49, 16.68, 16.84, 16.99, 17.12, 17.25, 17.36]
              // data: [14.86, 14.56, 14.3, 14.1, 13.96, 13.84, 13.78, 13.76, 13.75, 13.76, 13.8, 13.86, 13.94, 14.05, 14.18, 14.33, 14.51, 14.7, 14.9, 15.11, 15.32, 15.53, 15.74, 15.95, 16.15, 16.34, 16.53, 16.71, 16.88, 17.05, 17.21, 17.36, 17.51]
            },
            // 线条三
            {
              name: 'P25',
              // 折线类型
              type: 'line',
              // 是否光滑
              smooth: true,
              // 拐点类型
              symbol: 'none',
              // 拐点大小
              symbolSize: 7,
              data: referenceWeightCurveDataOfGirlsP25
              // data: [2.96, 4.82, 6.34, 7.21, 8.08, 8.74, 9.33, 9.91, 10.51, 11.08, 12.12, 13.11, 14.05, 14.97, 15.92, 16.84, 17.78, 18.68, 19.6, 20.62, 21.71, 22.81, 23.99, 25.23, 26.61, 28.15, 29.84, 31.81, 33.86, 36.04, 38.09, 40, 41.69, 43.19, 44.43, 45.36, 46.06, 46.47, 46.76, 46.9, 47.14]
              // data: [14.76, 14.48, 14.27, 14.12, 13.99, 13.88, 13.78, 13.71, 13.67, 13.63, 13.63, 13.65, 13.71, 13.8, 13.93, 14.1, 14.3, 14.53, 14.8, 15.08, 15.37, 15.67, 15.96, 16.24, 16.51, 16.75, 16.96, 17.16, 17.33, 17.48, 17.61, 17.74, 17.86]
              // data: [15.13, 14.81, 14.54, 14.34, 14.2, 14.09, 14.03, 14.02, 14.03, 14.05, 14.1, 14.19, 14.29, 14.41, 14.56, 14.73, 14.92, 15.12, 15.34, 15.56, 15.78, 16.01, 16.23, 16.45, 16.66, 16.86, 17.05, 17.24, 17.42, 17.59, 17.76, 17.92, 18.07]
            },
            // 线条四
            {
              name: 'P50',
              // 折线类型
              type: 'line',
              // 是否光滑
              smooth: true,
              // 拐点类型
              symbol: 'none',
              // 拐点大小
              symbolSize: 7,
              data: referenceWeightCurveDataOfGirlsP50
              // data: [3.21, 5.21, 6.83, 7.77, 8.69, 9.4, 10.02, 10.65, 11.3, 11.92, 13.05, 14.13, 15.16, 16.17, 17.22, 18.26, 19.33, 20.37, 21.44, 22.64, 23.93, 25.25, 26.67, 28.19, 29.87, 31.76, 33.8, 36.1, 38.4, 40.77, 42.89, 44.79, 46.42, 47.83, 48.97, 49.82, 50.45, 50.81, 51.07, 51.2, 51.41]
              // data: [15.95, 15.64, 15.42, 15.27, 15.15, 15.06, 14.99, 14.96, 14.96, 14.97, 15.02, 15.1, 15.21, 15.37, 15.57, 15.82, 16.09, 16.4, 16.74, 17.09, 17.45, 17.8, 18.15, 18.48, 18.78, 19.06, 19.31, 19.53, 19.72, 19.89, 20.04, 20.18, 20.32]
              // data: [16.33, 15.97, 15.66, 15.45, 15.32, 15.23, 15.22, 15.27, 15.35, 15.45, 15.59, 15.77, 15.96, 16.18, 16.42, 16.68, 16.96, 17.24, 17.54, 17.83, 18.11, 18.39, 18.67, 18.93, 19.19, 19.43, 19.66, 19.88, 20.09, 20.29, 20.48, 20.67, 20.84]
            },
            // 线条五
            {
              name: 'P75',
              // 折线类型
              type: 'line',
              // 是否光滑
              smooth: true,
              // 拐点类型
              symbol: 'none',
              // 拐点大小
              symbolSize: 7,
              data: referenceWeightCurveDataOfGirlsP75
              // data: [3.49, 5.64, 7.37, 8.37, 9.36, 10.12, 10.79, 11.46, 12.17, 12.84, 14.07, 15.25, 16.38, 17.5, 18.66, 19.83, 21.06, 22.27, 23.51, 24.94, 26.48, 28.05, 29.77, 31.63, 33.72, 36.05, 38.53, 41.24, 43.85, 46.42, 48.6, 50.45, 51.97, 53.23, 54.23, 54.96, 55.49, 55.79, 56.01, 56.11, 56.28]
              // data: [17.32, 16.99, 16.76, 16.61, 16.53, 16.48, 16.45, 16.48, 16.53, 16.61, 16.73, 16.89, 17.1, 17.37, 17.68, 18.03, 18.42, 18.84, 19.29, 19.74, 20.19, 20.63, 21.05, 21.45, 21.81, 22.14, 22.43, 22.68, 22.9, 23.1, 23.27, 23.43, 23.59]
              // data: [17.71, 17.3, 16.97, 16.76, 16.65, 16.6, 16.66, 16.79, 16.97, 17.2, 17.47, 17.78, 18.12, 18.48, 18.86, 19.25, 19.65, 20.05, 20.45, 20.84, 21.22, 21.58, 21.93, 22.26, 22.57, 22.86, 23.14, 23.4, 23.64, 23.88, 24.1, 24.31, 24.51]
            },
            // 线条六
            {
              name: 'P90',
              // 折线类型
              type: 'line',
              // 是否光滑
              smooth: true,
              // 拐点类型
              symbol: 'none',
              // 拐点大小
              symbolSize: 7,
              data: referenceWeightCurveDataOfGirlsP90
              // data: [3.75, 6.06, 7.9, 8.96, 10.01, 10.82, 11.53, 12.25, 13.01, 13.74, 15.08, 16.36, 17.59, 18.81, 20.1, 21.41, 22.81, 24.19, 25.62, 27.28, 29.08, 30.95, 33, 35.26, 37.79, 40.63, 43.61, 46.78, 49.73, 52.49, 54.71, 56.46, 57.81, 58.88, 59.7, 60.28, 60.69, 60.91, 61.07, 61.15, 61.28]
              // data: [17.68, 17.34, 17.11, 16.97, 16.89, 16.85, 16.84, 16.88, 16.96, 17.05, 17.19, 17.38, 17.62, 17.92, 18.26, 18.65, 19.08, 19.53, 20.01, 20.49, 20.97, 21.44, 21.88, 22.3, 22.68, 23.02, 23.32, 23.59, 23.82, 24.02, 24.2, 24.37, 24.52]
              // data: [18.07, 17.65, 17.31, 17.11, 17, 16.97, 17.04, 17.2, 17.41, 17.67, 17.99, 18.34, 18.72, 19.12, 19.54, 19.98, 20.41, 20.85, 21.29, 21.71, 22.11, 22.5, 22.86, 23.21, 23.54, 23.85, 24.14, 24.41, 24.66, 24.9, 25.13, 25.35, 25.56]
            },
            // 线条七
            {
              name: 'P97',
              // 折线类型
              type: 'line',
              // 是否光滑
              smooth: true,
              // 拐点类型
              symbol: 'none',
              // 拐点大小
              symbolSize: 7,
              data: referenceWeightCurveDataOfGirlsP97
              // data: [4.04, 6.51, 8.47, 9.59, 10.71, 11.57, 12.33, 13.11, 13.93, 14.71, 16.16, 17.55, 18.89, 20.24, 21.67, 23.14, 24.72, 26.3, 27.96, 29.89, 32.01, 34.23, 36.69, 39.41, 42.51, 45.97, 49.59, 53.33, 56.67, 59.64, 61.86, 63.45, 64.55, 65.36, 65.93, 66.3, 66.55, 66.69, 66.78, 66.82, 66.89]
              // data: [18.61, 18.27, 18.03, 17.9, 17.84, 17.84, 17.88, 17.96, 18.09, 18.25, 18.45, 18.72, 19.05, 19.43, 19.88, 20.37, 20.91, 21.47, 22.04, 22.61, 23.21, 23.72, 24.23, 24.7, 25.13, 25.52, 25.85, 26.15, 26.4, 26.62, 26.82, 27, 27.17]
              // data: [19.01, 18.56, 18.22, 18.02, 17.93, 17.93, 18.06, 18.3, 18.61, 18.97, 19.4, 19.88, 20.39, 20.92, 21.47, 22.02, 22.57, 23.11, 23.64, 24.15, 24.63, 25.08, 25.51, 25.91, 26.28, 26.63, 26.95, 27.25, 27.53, 27.79, 28.04, 28.28, 28.51]
            },
            // 用户数据显示
            {
              name: '用户',
              type: 'line',
              color: 'black',
              symbol: 'circle',
              symbolSize: 10,
              data: [currentUsersDataOfAgeAndWeight]
            }
          ]
        }

        if (paramInformation.sex === 1) {
          // 使用配置 - 男
          chartsOfUsersWeight.setOption(usersWeightOptionOfBoy)
        } else {
          // 使用配置 - 女
          chartsOfUsersWeight.setOption(usersWeightOptionOfGirl)
        }
      }
    }
  }
</script>

<style scoped>

</style>
